app/Controllers/Donatur.php

SELECT *
FROM `donatur`
---
    public function index()
    {
        $key = getenv('TOKEN_SECRET');
        $header = $this->request->getServer('HTTP_AUTHORIZATION');
        if(!$header) return $this->failUnauthorized('Token Required');
        $token = explode(' ', $header)[1];
        try {
            $decoded = JWT::decode($token, new Key ($key, 'HS256'));
            $idusr = $decoded->uid;
            if ($idusr != null){
                $model = new DonaturModel();
                $data = $model->findAll();

SELECT *
FROM `keuangan`
SELECT COUNT(*) AS `numrows`
FROM `keuangan`
INSERT INTO `donatur` (`id_keuangan`, `tgl_donatur`, `wilayah_donatur`, `petugas_donatur`, `nominal_donatur`, `create_at`, `update_at`) VALUES ('84', '2023-05-31', 'RT01/RW01', 'Bpk. Imam syafi\'i', '340000', '2023-06-12', '2023-06-12')
---
    public function create()
    {
        $key = getenv('TOKEN_SECRET');
        $header = $this->request->getServer('HTTP_AUTHORIZATION');
        if(!$header) return $this->failUnauthorized('Token Required');
        $token = explode(' ', $header)[1];
        try {
            $decoded = JWT::decode($token, new Key ($key, 'HS256'));
            $lvlusr = $decoded->level;
            if ($lvlusr == 2 || $lvlusr == 4){
                $model = new DonaturModel();
                if ($model->cekData($this->request->getPost('tgl_donatur'), $this->request->getPost('wilayah_donatur'))){
                    $this->createKeuanganDonatur($lvlusr, $this->request->getPost('tgl_donatur'),
                    $this->request->getPost('wilayah_donatur'), $this->request->getPost('petugas_donatur'), $this->request->getPost('nominal_donatur'),
                    $this->getTime(),$this->getTime() );
                    $mdlKeu = new KeuanganModel();
                    $datahh = $mdlKeu->findAll();
                    $datakeu = $mdlKeu->countAllResults();
                    $data = [
                        'id_keuangan' => $datahh[$datakeu-1]['id_keuangan'],
                        'tgl_donatur' => $this->request->getPost('tgl_donatur'),
                        'wilayah_donatur' => $this->request->getPost('wilayah_donatur'),
                        'petugas_donatur' => $this->request->getPost('petugas_donatur'),
                        'nominal_donatur' => $this->request->getPost('nominal_donatur'),
                        'create_at' => $this->getTime(),
                        'update_at' => $this->getTime()
                    ];
                    $model->insert($data);

INSERT INTO `keuangan` (`no_keuangan`, `tipe_keuangan`, `tgl_keuangan`, `keterangan_keuangan`, `jenis_keuangan`, `status_keuangan`, `nominal_keuangan`, `jml_kas_awal`, `jml_kas_akhir`, `deskripsi_keuangan`, `create_at`, `update_at`) VALUES ('KEU-2306120021', 'Pemasukan', '2023-05-31', 'Donatur RT01/RW01', 'Donatur', 'Selesai', '340000', '30130923', 30470923, 'Donatur wilayah RT01/RW01 dengan petugas Bpk. Imam syafi\'i', '2023-06-12', '2023-06-12')
---
    public function createKeuanganDonatur($lvlusr, $tgl_donatur, $wilayah_donatur, $petugas_donatur, $nominal_donatur, $create_at, $update_at)
    {
        try {
            if ($lvlusr == 2 || $lvlusr == 4){
                $model = new KeuanganModel();
                $data = [
                    'no_keuangan' => $model->getNomorKeuangan(),
                    'tipe_keuangan' => "Pemasukan",
                    'tgl_keuangan' => $tgl_donatur,
                    'keterangan_keuangan' => "Donatur ".$wilayah_donatur,
                    'jenis_keuangan' => "Donatur",
                    'status_keuangan' => "Selesai",
                    'nominal_keuangan' => $nominal_donatur,
                    'jml_kas_awal' =>$this->getSaldo(),
                    'jml_kas_akhir' => $this->getSaldo()+$nominal_donatur,
                    'deskripsi_keuangan' => "Donatur wilayah ".$wilayah_donatur." dengan petugas ".$petugas_donatur,
                    'create_at' => $create_at,
                    'update_at' => $update_at
                ];
                // $data = json_decode(file_get_contents("php://input"));
                // $data = $this->request->getPost();
                $model->insert($data);