app/Controllers/GantiPassword.php

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
    public function update($id = null)
    {
        $key = getenv('TOKEN_SECRET');
        $header = $this->request->getServer('HTTP_AUTHORIZATION');
        if(!$header) return $this->failUnauthorized('Token Required');
        $token = explode(' ', $header)[1];
        $decoded = JWT::decode($token, new Key ($key, 'HS256'));
        $idusr = $decoded->uid;
        $lvl = $decoded->level;
        helper(['form']);
        if ($lvl == 4){
            $rules = [
                'passwordbaru' => 'required|min_length[6]',
                'konfirmasipassword' => 'matches[passwordbaru]'
            ];
        } else {
            $rules = [
                'passwordsaatini' => 'required|min_length[6]',
                'passwordbaru' => 'required|min_length[6]',
                'konfirmasipassword' => 'matches[passwordbaru]'
            ];
        }
        if(!$this->validate($rules)) return $this->fail($this->validator->getErrors());
        $model = new UserModel();
        $user = $model->where("id", $id)->first();