app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'muh11@gmail.com'
 LIMIT 1
---
    public function index()
    {
        helper(['form']);
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ];
        if(!$this->validate($rules)) return $this->fail($this->validator->getErrors());
        $model = new UserModel();
        $user = $model->where("email", $this->request->getVar('email'))->first();