app/Controllers/User.php

SELECT *
FROM `users`
---
    public function index()
    {

        $key = getenv('TOKEN_SECRET');
        $header = $this->request->getServer('HTTP_AUTHORIZATION');
        if(!$header) return $this->failUnauthorized('Token Required');
        $token = explode(' ', $header)[1];

        try {
            $decoded = JWT::decode($token, new Key ($key, 'HS256'));
            $lvl = $decoded->level;
            $model = new UserModel();
            $data = $model->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '15'
DELETE FROM `users`
WHERE `id` IN ('15')
---
    public function delete($id = null)
    {
        $key = getenv('TOKEN_SECRET');
        $header = $this->request->getServer('HTTP_AUTHORIZATION');
        if(!$header) return $this->failUnauthorized('Token Required');
        $token = explode(' ', $header)[1];

        try {
            $decoded = JWT::decode($token, new Key ($key, 'HS256'));
            $lvl = $decoded->level;
            $model = new UserModel();
            $data = $model->find($id);
            $response = [
                'level' => $decoded->level,
                'message' => 'Superadmin level required'
            ];
            if($data){
                if ($lvl == "4"){
                    $model->delete($id);